УчетВУправляющихДляГит1/src/Enums/ВидыРасходовНУ/ВидыРасходовНУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРасходовНУ</name>
  <enumValues>
    <name>АмортизационнаяПремия</name>
    <comment>Амортизационная премия (п. 1.1 ст. 259 НК РФ)</comment>
  </enumValues>
  <enumValues>
    <name>Амортизация</name>
  </enumValues>
  <enumValues>
    <name>АрендаФедеральногоИМуниципальногоИмущества</name>
  </enumValues>
  <enumValues>
    <name>ДобровольноеЛичноеСтрахование</name>
  </enumValues>
  <enumValues>
    <name>ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности</name>
  </enumValues>
  <enumValues>
    <name>ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников</name>
  </enumValues>
  <enumValues>
    <name>ЕСН</name>
  </enumValues>
  <enumValues>
    <name>КомандировочныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>МатериальныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>НалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>НеУчитываемыеВЦеляхНалогообложения</name>
  </enumValues>
  <enumValues>
    <name>НИОКР</name>
  </enumValues>
  <enumValues>
    <name>НИОКРПоПеречнюПравительстваРФ</name>
  </enumValues>
  <enumValues>
    <name>ОбязательноеИДобровольноеСтрахованиеИмущества</name>
  </enumValues>
  <enumValues>
    <name>ОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ОсвоениеПриродныхРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ПредставительскиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов</name>
  </enumValues>
  <enumValues>
    <name>РасходыНаРекламуНормируемые</name>
  </enumValues>
  <enumValues>
    <name>РемонтОсновныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ВидыРасходовНУ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// Возвращает массив видов расходов, которые в налоговом учете нормируются,
// потому что для них главой 25 НК РФ предусмотрены ограничения сумм
//
Функция НормируемыеРасходы() Экспорт
	
	НормируемыеРасходы = Новый Массив;
	НормируемыеРасходы.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахование);
	НормируемыеРасходы.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников);
	НормируемыеРасходы.Добавить(Перечисления.ВидыРасходовНУ.РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов);
	НормируемыеРасходы.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности);
	НормируемыеРасходы.Добавить(Перечисления.ВидыРасходовНУ.ПредставительскиеРасходы);
	НормируемыеРасходы.Добавить(Перечисления.ВидыРасходовНУ.РасходыНаРекламуНормируемые);
	
	Возврат НормируемыеРасходы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
